/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memset.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: akostrik <akostrik@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/07 14:21:18 by akostrik          #+#    #+#             */
/*   Updated: 2022/11/10 16:45:24 by akostrik         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// копирует младший байт c в первые n символов массива, адресуемого параметром s
// Третий аргумент = колво байт, а не элементов, не учитывая тип данных

#include <stddef.h>

void* ft_memset(void *s, int c, size_t n)
{
	size_t	i;
	i=0;
	while (i < n)
	{
	  *((char *)s+i) = (char)c;
		i++;
	}  
	return (s);
}
